set search_path = "company";

create table supervisors
(
    id           int,
    name         varchar,
    title        varchar,
    salary       int,
    hire_date    date,
    subordinates int
);

insert into supervisors
values (12, 'Игорь Катамаранов', 'Супервайзер', 2500, '2012-11-02', 3),
       (13, 'Татьяна Восьмиглазова', 'Супервайзер', 2500, '2015-12-24', 5),
       (14, 'Всеволод Старозубов', 'Старший супервайзер', 6500, '2005-01-08', 34),
       (15, 'Зина Кашина', 'Супервайзер', 3000, '2019-01-03', 4),
       (16, 'Ричард Сапогов', 'Супервайзер', 2500, '2010-03-06', 7),
       (17, 'Гвидон Вишневский', 'Старший супервайзер', 7000, '2010-08-15', 28);